Web Services/1. Webservice Testing/Transactions/findTransactions/Test Case 10/Tibco_Output.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Body>
      <ns0:transactionList xmlns:ns0="http://www.hmco.com/EAI/OTS/Transaction">
         <ns0:transaction>
            <ns0:transactionID>0006031640</ns0:transactionID>
            <ns0:type>TRANSACTION_TYPE_STANDARD</ns0:type>
            <ns0:poNumber>200134</ns0:poNumber>
            <ns0:status>TRANSACTION_STATUS_PARTIALLY_PROCESSED</ns0:status>
            <ns0:creationDate>2011-08-22</ns0:creationDate>
            <ns0:orderSource>ORDER_SOURCE_FAX</ns0:orderSource>
            <ns0:division>DIVISION_RIVERSIDE</ns0:division>
            <ns0:salesOffice/>
            <ns0:customerEmail>jpoulin@irvingisd.net</ns0:customerEmail>
            <ns0:soldToCustomerID>0000250738</ns0:soldToCustomerID>
            <ns0:soldToSANNumber/>
            <ns0:soldToCustomerName>IRVING IND SCHOOL DISTRICT</ns0:soldToCustomerName>
            <ns0:soldToCustomerAddress>
               <ns1:addressLine1 xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer"/>
               <ns1:poBox xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">152637</ns1:poBox>
               <ns1:city xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">IRVING</ns1:city>
               <ns1:state xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">TX</ns1:state>
               <ns1:zipcode xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">75015-2637</ns1:zipcode>
               <ns1:countryCode xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">US</ns1:countryCode>
               <ns1:emailAddressStruct xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">
                  <ns1:emailAddress>jpoulin@irvingisd.net</ns1:emailAddress>
                  <ns1:isPrimary>true</ns1:isPrimary>
               </ns1:emailAddressStruct>
            </ns0:soldToCustomerAddress>
            <ns0:soldToCustomerEmailAddress>jpoulin@irvingisd.net</ns0:soldToCustomerEmailAddress>
            <ns0:shipToCustomerID>0000250739</ns0:shipToCustomerID>
            <ns0:shipToSANNumber/>
            <ns0:shipToCustomerName>IRVING IND SCHOOL DISTRICT</ns0:shipToCustomerName>
            <ns0:shipToCustomerAddress>
               <ns1:addressLine1 xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">2621 W AIRPORT FWY</ns1:addressLine1>
               <ns1:city xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">IRVING</ns1:city>
               <ns1:state xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">TX</ns1:state>
               <ns1:zipcode xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">75062-6020</ns1:zipcode>
               <ns1:countryCode xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">US</ns1:countryCode>
            </ns0:shipToCustomerAddress>
            <ns0:shipToCustomerEmailAddress>jpoulin@irvingisd.net</ns0:shipToCustomerEmailAddress>
            <ns0:billToCustomerID>0000250738</ns0:billToCustomerID>
            <ns0:billToSANNumber/>
            <ns0:billToCustomerName>IRVING IND SCHOOL DISTRICT</ns0:billToCustomerName>
            <ns0:billToCustomerAddress>
               <ns1:addressLine1 xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer"/>
               <ns1:poBox xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">152637</ns1:poBox>
               <ns1:city xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">IRVING</ns1:city>
               <ns1:state xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">TX</ns1:state>
               <ns1:zipcode xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">75015-2637</ns1:zipcode>
               <ns1:countryCode xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">US</ns1:countryCode>
               <ns1:emailAddressStruct xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">
                  <ns1:emailAddress>jpoulin@irvingisd.net</ns1:emailAddress>
                  <ns1:isPrimary>true</ns1:isPrimary>
               </ns1:emailAddressStruct>
            </ns0:billToCustomerAddress>
            <ns0:billToCustomerEmailAddress>jpoulin@irvingisd.net</ns0:billToCustomerEmailAddress>
            <ns0:isHeaderComplete>true</ns0:isHeaderComplete>
            <ns0:transactionRejectionStatus>TRANSACTION_REJECTION_STATUS_NOT_REJECTED</ns0:transactionRejectionStatus>
            <ns0:transactionLineItem>
               <ns0:productInfo>
                  <ns0:lineNo>110</ns0:lineNo>
                  <ns0:materialID>000000000000949115</ns0:materialID>
                  <ns0:isbn>9780782991376</ns0:isbn>
                  <ns0:description>LOGRAMOS PRAC TST LV 9 PK25</ns0:description>
                  <ns0:couponCode/>
                  <ns0:promotionType/>
                  <ns0:quantity>44</ns0:quantity>
                  <ns0:listPrice>1.29911E3</ns0:listPrice>
                  <ns0:netPrice>1.29911E3</ns0:netPrice>
                  <ns0:productDivision>DIVISION_RIVERSIDE</ns0:productDivision>
                  <ns0:listDiscount>0.0E0</ns0:listDiscount>
                  <ns0:isEGood>false</ns0:isEGood>
                  <ns0:isSubscription>false</ns0:isSubscription>
               </ns0:productInfo>
               <ns0:lineitemStatus>LINE_ITEM_STATUS_NOT_YET_PROCESSED</ns0:lineitemStatus>
               <ns0:lineitemRejectionStatus>LINE_ITEM_REJECTION_STATUS_NOT_REJECTED</ns0:lineitemRejectionStatus>
               <ns0:isLineitemComplete>true</ns0:isLineitemComplete>
               <ns0:titleStatus>MATERIAL_STATUS_IN_PRINT</ns0:titleStatus>
               <ns0:requestDate>2011-08-22</ns0:requestDate>
               <ns0:availableDate>2012-01-18</ns0:availableDate>
               <ns0:salesRep>
                  <ns0:repID>0000022541</ns0:repID>
                  <ns0:repName>HEATHER QUEENER 33-378</ns0:repName>
                  <ns0:sfaRepID>703378</ns0:sfaRepID>
               </ns0:salesRep>
               <ns0:itemType>ITEM_TYPE_SALE</ns0:itemType>
               <ns0:isKitComponent>false</ns0:isKitComponent>
            </ns0:transactionLineItem>
            <ns0:shipToCareOf_1>DR. WHIT JOHNSTONE</ns0:shipToCareOf_1>
            <ns0:shipToCareOf_2/>
         </ns0:transaction>
      </ns0:transactionList>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>